package academy.learnprograming;

// あなたの仕事は、簡単な銀行アプリケーションを作成することです。
// 銀行クラスがあるはずです。
    // 支店の配列リストを持つべきです。
        // 各支店には、顧客の配列リストが必要です。
        // 顧客クラスには、Doubles (transaction) の配列リストが必要です。
            // 顧客です。
                // 名前と、ダブルスのArrayListです。
        // 支店です。
            // 新しい顧客と最初の取引の金額を追加することができる必要があります。
            // また、その顧客/支店の追加取引を追加する必要があります。
        // 銀行です。
            // 新しい支店を追加
            // 最初の取引でその支店に顧客を追加します。
            // その支店の既存顧客の取引を追加します。
            // 特定の支店の顧客のリストを表示します。
// 彼らの取引の
// コード内でのオートボクシング化とアンボクシング化のデモ
// ヒント: 取引
// データの検証を追加します。
    // 例えば、存在するかどうか、存在しないかどうかなどをチェックします。
// 特定のアクションを実行するためにコードを追加する場所を考えてください。
public class Main {

    public static void main(String[] args) {

    }
}
